# глобальные переменные
#userChoice = 0      # переменная, которая хранит выбор пользователя	userChoice = 0
                    # Задание 1: вобъявить переменную, котоая будет хранить 15 значений
#print('Меню:')
#print('1. Вывести на экран все знаения')
#print('3. Удалить значение')
#print('4. Найти значение')
#print('5. Отсортировать значения')
#print('6. Выйти')
#print('Введите опцию:')
#userChoice = int(input())

# Задание 2: в цикле while создать ограничения для ввода опций таким образом, чтобы
# программа принимала только знаенчия, из меню (1-6), в остальных случаях выдвала ошибку


# Задание 3: Реализовать опцию 1 и 2 из списка меню
#while userChoice != 6:
#    print('Введите опцию:', userChoice)


#    print('Меню:')
#    print('1. Вывести на экран все знаения')
#    print('2. Добавить значение')
#    print('3. Удалить значение')
#    print('4. Найти значение')
#    print('5. Отсортировать значения')
#   print('6. Выйти')
#   print('Введите опцию:')
#    userChoice = int(input())

print("Задание 1: вобъявить переменную, котоая будет хранить 15 значений")
userChoice = 0

print('Меню:')
print('1. Вывести на экран все знаения')
print('2. Добавить значение')
print('3. Удалить значение')
print('4. Найти значение')
print('5. Отсортировать значения')
print('6. mySting')
print('7. myList')
print('8. myTuple')
print('9. myName')
print('10. myCar')
print('11. myfriends')
print('12. myFamily')
print('13. Умножение')
print('14. Вычетание')
print('15. Деление')



print('Задание 2')
Value = 0

Value = ['1. Вывести на экран все знаения','2. Добавить значение','3. Удалить значение','4. Найти значение','5. Отсортировать значения','6. mySting','7. myList','8. myTuple','9. myName','10. myCar','11. myfriends','12. myFamily','13. Умножение','14. Вычетание','15. Деление']

Value = int(input())

while Value !=6:

 for Value in Value:
  if Value == '1. Вывести на экран все знаения''2. Добавить значение''3. Удалить значение''4. Найти значение''5. Отсортировать значения''6. mySting':
   print(Value)


