# переменная называется "variable"
# --ВСЕГДА-- называть переменные значимым именем или тем, для она используется.
variable = 13   # equal to 13
counter = 0     # используется для того, чтобы что-то считать


# переменные в языке Python начинаються с прописной буквы. Все последующие слова пишуться слитно и с заглавной буквы.
# переменные --ВСЕГДА-- латиницей, на анлгийском языке.
blueCarIgor = ''


# Добавляйте текстовое описание перед выводом значений переменной для того, чтобы было легче читать вывод
# результата исполнения кода.
print("Значение переменной: ", counter)
